# GetValidTypes Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..GetValidTypes Method
Element Class See Also
---
Obtains a set of types that are valid for this element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ICollection<ElementId> GetValidTypes()
```

Visual Basic
---
```text
Public Function GetValidTypes As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetValidTypes()
```

# ### Return Value
A set of element IDs of types that are valid for this element or an empty set if element cannot have type assigned.
# See Also
Element Class
GetValidTypes Overload
Autodesk.Revit.DB Namespace